       IDENTIFICATION DIVISION.
       PROGRAM-ID. DISCOUNT-SUB.

       DATA DIVISION.
       LINKAGE SECTION.
       01  PRICE          PIC 9(5)V99.
       01  DISCOUNT-RATE  PIC V999.
       01  FINAL-PRICE    PIC 9(5)V99.

       PROCEDURE DIVISION USING PRICE, DISCOUNT-RATE, FINAL-PRICE.
           COMPUTE FINAL-PRICE = PRICE - (PRICE * DISCOUNT-RATE).
           GOBACK.
